ferrets6/ESP32-S3-wifi-kvm/src/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <Preferences.h>
#include <ESPAsyncWebServer.h>
#include <USB.h>
#include <ElegantOTA.h>
#include <esp32-hal-rgb-led.h>
#include <esp_event.h>

#include "hid_bridge.h"
#include "keyboard_impl.h"
#include "web_ui.h"

#ifdef KVM_KEYBOARD_ONLY
// Keyboard-only composite: a single, Report-ID-less HID interface for
// maximum BIOS/UEFI/GRUB boot-keyboard compatibility (see boot_keyboard.h).
// No mouse on this build.
KeyboardClass Keyboard;
#else
// Normal composite USB HID device: keyboard + mouse over the same USB-C
// port, via the Arduino-ESP32 core's native TinyUSB stack (USB Mode:
// USB-OTG). Both devices share one HID interface multiplexed by Report ID.
#include <USBHIDMouse.h>
KeyboardClass Keyboard;
USBHIDMouse Mouse;
#endif

AsyncWebServer server(80);
AsyncWebSocket ws("/ws");
Preferences prefs;

// No auth on /update: this board only ever sits on a trusted local network
// (open setup AP, no port-forwarding). Empty strings disable ElegantOTA's
// HTTP Basic Auth check entirely.
static const char *OTA_USERNAME = "";
static const char *OTA_PASSWORD = "";

String apSsid;
String currentStaSsid;
bool staConnected = false;

unsigned long restartAtMs = 0;

// Small in-memory event log for the /status page. There is no Serial-over-USB
// console once ARDUINO_USB_CDC_ON_BOOT is disabled (needed for BIOS/GRUB HID
// compatibility, see platformio.ini), and the board is often plugged into a
// host we have no other way to inspect (NAS, headless PC...), so this is the
// only window into what the USB stack and WiFi are actually doing.
static const int LOG_CAPACITY = 100;
String eventLog[LOG_CAPACITY];
int eventLogCount = 0;
bool logCommands = false;  // debug only: toggled from /status, off again after reboot

void logEvent(const String &msg) {
  // Millisecond resolution matters here: BIOS/GRUB's whole USB negotiation
  // happens within the first second or two after power-on.
  eventLog[eventLogCount % LOG_CAPACITY] = "[" + String(millis()) + "ms] " + msg;
  eventLogCount++;
}

void usbEventHandler(void *arg, esp_event_base_t base, int32_t id, void *data) {
  switch (id) {
    case ARDUINO_USB_STARTED_EVENT: logEvent("USB: host connected (enumerated)"); break;
    case ARDUINO_USB_STOPPED_EVENT: logEvent("USB: host disconnected"); break;
    case ARDUINO_USB_SUSPEND_EVENT: logEvent("USB: suspended by host"); break;
    case ARDUINO_USB_RESUME_EVENT: logEvent("USB: resumed by host"); break;
  }
}

// Low-level HID class control requests. A real boot-keyboard host (BIOS,
// GRUB) is expected to issue SET_PROTOCOL(BOOT) on the keyboard interface
// as part of actually using it; if that request never shows up here at all,
// the host isn't even attempting to treat our HID interface as a keyboard
// (as opposed to just power-enumerating the composite device and stopping).
// "instance" is the HID interface index in registration order: 0 = keyboard
// (USBHIDKeyboard Keyboard is declared/constructed first), 1 = mouse.
void hidProtocolEventHandler(void *arg, esp_event_base_t base, int32_t id, void *data) {
  auto *p = (arduino_usb_hid_event_data_t *)data;
  if (id == ARDUINO_USB_HID_SET_PROTOCOL_EVENT) {
    logEvent(
      "HID: instance " + String(p->instance) + " SET_PROTOCOL -> " + (p->set_protocol.protocol == 0 ? "BOOT" : "REPORT")
    );
  } else if (id == ARDUINO_USB_HID_SET_IDLE_EVENT) {
    logEvent("HID: instance " + String(p->instance) + " SET_IDLE rate=" + String(p->set_idle.idle_rate));
  }
}

// Onboard addressable RGB LED, used purely as an "a command just arrived"
// activity indicator: a brief, dim flash on every WebSocket message,
// regardless of what it contains (so it also works as a safe connectivity
// test that never touches the HID keyboard/mouse). GPIO21 confirmed via
// the "lt:<gpio>" diagnostic command (see handleWsMessage / tools/led-test.ps1)
// on this specific "ESP32-S3 Super Mini" board; other clones may differ.
static const uint8_t LED_PIN = 21;
static const uint8_t LED_FLASH_BRIGHTNESS = 12;  // out of 255, deliberately dim
static const uint16_t LED_FLASH_MS = 40;
unsigned long ledOffAtMs = 0;
bool ledEnabled = true;  // toggled from the web UI, persisted in NVS

// State for the "lt:<gpio>" diagnostic command (see handleWsMessage).
uint8_t ledTestPin = 0;
unsigned long ledTestOffAtMs = 0;

void ledFlash() {
  if (!ledEnabled) {
    return;
  }
  rgbLedWrite(LED_PIN, 0, 0, LED_FLASH_BRIGHTNESS);  // dim blue
  ledOffAtMs = millis() + LED_FLASH_MS;
}

// ---------------------------------------------------------------------
// WiFi
// ---------------------------------------------------------------------

void deriveApSsid() {
  // Read the factory MAC straight from eFuse instead of WiFi.macAddress()/
  // softAPmacAddress(): those return whatever the WiFi driver's interface
  // MAC happens to be at the moment of the call, which is unreliable (and
  // was observed to be all-zero / a different derived value) before the
  // driver has fully started. ESP.getEfuseMac() has no such dependency.
  // Only used to tell multiple boards apart by SSID; the AP itself is open
  // (see startAccessPoint()) since it only ever serves the one-time /wifi
  // setup page.
  uint64_t efuseMac = ESP.getEfuseMac();
  uint8_t mac[6];
  for (int i = 0; i < 6; i++) {
    mac[i] = (efuseMac >> (8 * i)) & 0xFF;
  }
  char ssidBuf[24];
  snprintf(ssidBuf, sizeof(ssidBuf), "ESP32-KVM-%02X%02X", mac[4], mac[5]);
  apSsid = ssidBuf;
}

bool tryConnectStation(const String &ssid, const String &pass, uint32_t timeoutMs) {
  if (ssid.isEmpty()) {
    return false;
  }
  Serial.printf("[wifi] connecting to '%s'...\n", ssid.c_str());
  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid.c_str(), pass.c_str());

  uint32_t start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < timeoutMs) {
    delay(250);
    Serial.print('.');
  }
  Serial.println();

  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("[wifi] connected, IP: %s\n", WiFi.localIP().toString().c_str());
    logEvent("WiFi: connected to '" + ssid + "', IP " + WiFi.localIP().toString());
    return true;
  }
  Serial.println("[wifi] station connect failed");
  logEvent("WiFi: failed to connect to '" + ssid + "', falling back to AP");
  return false;
}

void startAccessPoint() {
  WiFi.mode(WIFI_AP);
  WiFi.softAP(apSsid.c_str());  // open network: only used for the one-time /wifi setup
  Serial.printf("[wifi] AP mode: SSID='%s' (open) IP=%s\n", apSsid.c_str(), WiFi.softAPIP().toString().c_str());
  logEvent("WiFi: AP mode '" + apSsid + "' (open), IP " + WiFi.softAPIP().toString());
}

