ferrets6/ESP32-S3-wifi-kvm/src/main.cpp
void setupWiFi() {
  deriveApSsid();
  currentStaSsid = prefs.getString("ssid", "");
  String pass = prefs.getString("pass", "");

  staConnected = tryConnectStation(currentStaSsid, pass, 12000);
  if (!staConnected) {
    startAccessPoint();
  }
}

// Who joins/leaves our AP, and why the STA link last dropped (the reason is
// only stored here, then reported by the watchdog/retry logic below).
uint8_t lastStaDisconnectReason = 0;

String staDisconnectReason() {
  return String(lastStaDisconnectReason) + " " + WiFi.disconnectReasonName((wifi_err_reason_t)lastStaDisconnectReason);
}

String macToString(const uint8_t *mac) {
  char buf[18];
  snprintf(buf, sizeof(buf), "%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  return buf;
}

void wifiEventHandler(arduino_event_id_t event, arduino_event_info_t info) {
  switch (event) {
    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
      lastStaDisconnectReason = info.wifi_sta_disconnected.reason;
      break;
    case ARDUINO_EVENT_WIFI_AP_STACONNECTED:
      logEvent("WiFi AP: client " + macToString(info.wifi_ap_staconnected.mac) + " joined");
      break;
    case ARDUINO_EVENT_WIFI_AP_STAIPASSIGNED:
      logEvent("WiFi AP: client " + macToString(info.wifi_ap_staipassigned.mac) + " got IP " +
               IPAddress(info.wifi_ap_staipassigned.ip.addr).toString());
      break;
    case ARDUINO_EVENT_WIFI_AP_STADISCONNECTED:
      logEvent("WiFi AP: client " + macToString(info.wifi_ap_stadisconnected.mac) + " left");
      break;
    default:
      break;
  }
}

// Runtime watchdog for STA mode: setupWiFi() only checks the link at boot.
// Non-blocking so HID/WS keep running: each check fires one reconnect()
// and the next check (WIFI_CHECK_MS later) is its timeout.
static const uint32_t WIFI_CHECK_MS = 10000;
static const uint8_t WIFI_MAX_RECONNECTS = 3;
unsigned long wifiLastCheckMs = 0;
uint8_t wifiReconnectAttempts = 0;

// While in AP mode, periodically retry the saved network in AP+STA mode so
// the AP stays up during the attempt. Skipped while someone is on the AP
// (joining the router can move the radio's channel and drop them).
static const uint32_t WIFI_AP_RETRY_MS = 60000;
static const uint32_t WIFI_AP_RETRY_TIMEOUT_MS = 12000;
unsigned long wifiApRetryStartMs = 0;  // non-zero while a retry is in flight
uint16_t wifiApRetryFailures = 0;
uint8_t wifiApRetryLastReason = 0;
bool wifiApRetryPaused = false;

// Only state changes are logged (first failure, a new failure reason,
// pause/resume, success), not every attempt: one line a minute would push
// everything else out of the event log within a couple of hours.
void retrySavedNetwork() {
  if (wifiApRetryStartMs) {
    if (WiFi.status() == WL_CONNECTED) {
      WiFi.mode(WIFI_STA);  // drop the AP, back to normal operation
      staConnected = true;
      wifiApRetryStartMs = 0;
      logEvent("WiFi: saved network '" + currentStaSsid + "' is back after " + String(wifiApRetryFailures) +
               " failed retries, IP " + WiFi.localIP().toString() + ", AP stopped");
      wifiApRetryFailures = 0;
      wifiApRetryLastReason = 0;
    } else if (millis() - wifiApRetryStartMs > WIFI_AP_RETRY_TIMEOUT_MS) {
      // Read the reason before disconnect(), which records its own (ASSOC_LEAVE).
      String reason = staDisconnectReason();
      bool newReason = lastStaDisconnectReason != wifiApRetryLastReason;
      wifiApRetryLastReason = lastStaDisconnectReason;
      WiFi.disconnect();
      WiFi.mode(WIFI_AP);
      wifiApRetryStartMs = 0;
      wifiApRetryFailures++;
      if (wifiApRetryFailures == 1 || newReason) {
        logEvent("WiFi: retry of '" + currentStaSsid + "' failed (reason " + reason + "), retrying every " +
                 String(WIFI_AP_RETRY_MS / 1000) + "s while nobody is on the AP");
      }
    }
    return;
  }

  if (currentStaSsid.isEmpty()) {
    return;
  }
  bool clientsOnAp = WiFi.softAPgetStationNum() > 0;
  if (clientsOnAp != wifiApRetryPaused) {
    wifiApRetryPaused = clientsOnAp;
    logEvent(clientsOnAp ? "WiFi: retries of '" + currentStaSsid + "' paused while a client is on the AP (" +
                               String(wifiApRetryFailures) + " failed so far)"
                         : "WiFi: AP empty again, resuming retries of '" + currentStaSsid + "'");
  }
  if (clientsOnAp || millis() - wifiLastCheckMs < WIFI_AP_RETRY_MS) {
    return;
  }
  wifiLastCheckMs = millis();
  Serial.printf("[wifi] AP mode: retrying saved network '%s'\n", currentStaSsid.c_str());
  WiFi.mode(WIFI_AP_STA);
  WiFi.begin(currentStaSsid.c_str(), prefs.getString("pass", "").c_str());
  wifiApRetryStartMs = millis();
}

void checkWiFi() {
  if (!staConnected) {
    retrySavedNetwork();
    return;
  }
  if (millis() - wifiLastCheckMs < WIFI_CHECK_MS) {
    return;
  }
  wifiLastCheckMs = millis();

  if (WiFi.status() == WL_CONNECTED) {
    if (wifiReconnectAttempts) {
      logEvent("WiFi: reconnected to '" + currentStaSsid + "', IP " + WiFi.localIP().toString());
      wifiReconnectAttempts = 0;
    }
    return;
  }

  if (wifiReconnectAttempts < WIFI_MAX_RECONNECTS) {
    wifiReconnectAttempts++;
    logEvent("WiFi: connection to '" + currentStaSsid + "' lost (reason " + staDisconnectReason() +
             "), reconnect attempt " + String(wifiReconnectAttempts) + "/" + String(WIFI_MAX_RECONNECTS));
    WiFi.reconnect();
    return;
  }

  logEvent("WiFi: reconnect to '" + currentStaSsid + "' failed, falling back to AP");
  staConnected = false;
  wifiReconnectAttempts = 0;
  startAccessPoint();
}

// ---------------------------------------------------------------------
// HTTP routes
// ---------------------------------------------------------------------

void setupHttpRoutes() {
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->send(200, "text/html", INDEX_HTML);
  });

  server.on("/wifi", HTTP_GET, [](AsyncWebServerRequest *req) {
    String html = FPSTR(WIFI_HTML);
    html.replace("%SSID%", currentStaSsid);
    html.replace("%APSSID%", apSsid);
    html.replace("%LEDCHECKED%", ledEnabled ? "checked" : "");
    req->send(200, "text/html", html);
  });

  // Our own OTA upload page (dark theme, no third-party branding), served
  // instead of ElegantOTA's bundled page. Must be registered before
  // ElegantOTA.begin() so it wins the route match for GET /update;
  // ElegantOTA's own /ota/start and /ota/upload endpoints (the actual
  // upload logic, untouched) still power the upload underneath.
  server.on("/update", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->send(200, "text/html", OTA_HTML);
  });

  server.on("/wifi", HTTP_POST, [](AsyncWebServerRequest *req) {
    String ssid = req->hasParam("ssid", true) ? req->getParam("ssid", true)->value() : "";
    String pass = req->hasParam("pass", true) ? req->getParam("pass", true)->value() : "";
    prefs.putString("ssid", ssid);
    prefs.putString("pass", pass);
    req->send(200, "text/html",
               "<html><body style='font-family:sans-serif;background:#121316;color:#e8e8ea;padding:24px'>"
               "Saved. Restarting...</body></html>");
    restartAtMs = millis() + 1200;
  });

  server.on("/led", HTTP_POST, [](AsyncWebServerRequest *req) {
    ledEnabled = req->hasParam("enabled", true);
    prefs.putBool("ledEnabled", ledEnabled);
    logEvent(String("Settings: LED activity flash turned ") + (ledEnabled ? "on" : "off"));
    AsyncWebServerResponse *res = req->beginResponse(303);
    res->addHeader("Location", "/wifi");
    req->send(res);
  });

